sysbench/results/aws/mysql/alta/sequencial/re-test/read_7.txt
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 50
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            1732032
        write:                           0
        other:                           0
        total:                           1732032
    transactions:                        1732032 (28861.68 per sec.)
    queries:                             1732032 (28861.68 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      28861.6779
    time elapsed:                        60.0115s
    total number of events:              1732032

Latency (ms):
         min:                                    0.17
         avg:                                    1.73
         max:                                  104.69
         95th percentile:                        2.66
         sum:                              2999572.68

Threads fairness:
    events (avg/stddev):           34640.6400/569.23
    execution time (avg/stddev):   59.9915/0.00